{"props":{"log":{"id":"2021-08-08","date":"2021-08-08","name":"Session 0","image":"/dnd/image/undefined-undefined/logs/tabletop.png","content":{"prose":"<p>A the start of any campaign, it is good to have a Session 0. It gets players invested in their characters, an idea of how the campaign should be player, and to set up boundaries for each other so that everyone has a good time!</p>\n<hr>\n<p>We did our session 0 in person, a week before the campaign was due to kick off. This is the first time our group had done a session 0 for any campaign, but I had only heard positive things about them from people I knew, and the D&#x26;D community at large. They have been considered so important now, that event WotC has put guidelines in their latest source-book <a href=\"https://www.dndbeyond.com/posts/929-new-players-guide-how-to-make-the-most-of-session\" title=\"New Player’s Guide: How to Make the Most of Session Zero\"><em>Tasha’s Cauldron of Everything</em></a>.</p>\n<p>I decided to use an amazing template by <a href=\"https://www.youtube.com/channel/UCC8AgO4FbP11n_WBdFai7DA\" title=\"Bob&#x27;s Youtube page\">Bob World Builder</a>, which covers almost anything you could need in a session 0. You can find the template for free <a href=\"https://www.patreon.com/posts/39281630\" title=\"Session 0 template\">here on his Patreon</a>.</p>\n<p>The point of this log is to go over what we discussed in session 0, and note done anything interesting we found as a group when doing it.</p>\n<h2>Team building</h2>\n<p>This is a great topic to start any session 0 with. It may seem a bit silly or pointless at a glance, especially if you know the people you are playing with quite well like we did. However, we quickly noticed found how important the questions we asked were, as everyone was surprised by how some people answered. We decided to go in a circle, and all three questions that are outline in the template.</p>\n<ol>\n<li>What's one thing you love about RPGs?</li>\n<li>Are you most excited by combat, exploration and puzzles, or roleplay?</li>\n<li>As a player, what's one strength you bring to the group?</li>\n</ol>\n<p>Here are the answers the players gave.</p>\n<h3><a class=\"   \" href=\"/dnd/players/roadkill\">Roadkill</a></h3>\n<ol>\n<li>Collecting different things, and generally bringing a little chaos and fun</li>\n<li>Exploration and puzzles</li>\n<li>Creativity and uniqueness, and coming up with the unexpected</li>\n</ol>\n<h3><a class=\"   \" href=\"/dnd/players/willabelle\">Willabelle</a></h3>\n<ol>\n<li>Having a pet Manticore in a previous campaign</li>\n<li>Combat</li>\n<li>Creativity and flexibility</li>\n</ol>\n<h3><a class=\"   \" href=\"/dnd/players/ruerl\">Ruerl Aleanett</a></h3>\n<ol>\n<li>Problem solving</li>\n<li>Exploration and puzzles</li>\n<li>Alternate perspective</li>\n</ol>\n<h3><a class=\"   \" href=\"/dnd/players/grub\">Grub</a></h3>\n<ol>\n<li>Progression</li>\n<li>Role-play</li>\n<li>Moving things forward, and leadership</li>\n</ol>\n<h3><a class=\"   \" href=\"/dnd/players/elizabeth\">Elizabeth</a></h3>\n<ol>\n<li>Strategy</li>\n<li>Combat</li>\n<li>Bringing the chaos!</li>\n</ol>\n<p>As you can see, we have interesting but well balanced party!</p>\n<h2>Scheduling</h2>\n<p>I won't go too deep into scheduling here, but it is certainly an important thing to discuss. Some important things we decided though:</p>\n<ul>\n<li>We only like doing 3-4 hour sessions, weekly</li>\n<li>The campaign will be played in arcs. When a section seems to come to a nice conclusion, we will switch DMs and campaigns to let everyone get a chance to play</li>\n<li>If a player is absent, the character will still be around but not doing anything (inactive). We thought this is best for our table, so important character decisions are not made when the player is not there.</li>\n</ul>\n<p>This is a pretty simple system, but it is flexible enough for everyone to try and make the commitment, but accept that life gets in the way sometimes!</p>\n<h2>Table expectations</h2>\n<p>Some quick explanations of key table expectations we set as a group:</p>\n<h3>Smartphones</h3>\n<p>We use <a href=\"https://dndbeyond.com\">DnD Beyond</a> for our character sheets and other information during play. That may include this site one day as well!</p>\n<h3>Try to prevent metagaming when possible</h3>\n<p>We as a group are trying to get better at this, but there is a big knowledge difference with our players in all things D&#x26;D. Due to this, 'metagaming' is discouraged so that players don't feel left out. This also applies to things like \"My character isn't there, so I wouldn't know\" or asking the DM \"would I know this?\". We find it encourages more roleplay, and we all keep each other in check to make sure things run smoothly and fairly.</p>\n<h3>Narrative control</h3>\n<p>Storytelling is at the core of D&#x26;D, and the DM cannot be the only one having fun. With this in mind, the players wanted some control over what they did in the world, but with some guard rails. The DM's responsibility then falls to created a set of options to lay out, and the players can choose what they want to do with them. Everyone gets to create, and everyone hs fun!</p>\n<h3>Player v Player combat</h3>\n<p>Player vs Player combat can get sticky quickly, especially if player characters get hurt badly, or even die unexpectedly. The party here knows this from personal experience, and it actually ended a campaign.</p>\n<p>This this is a tricky rule, we decided to base it mutual consent. Using consent, players can still come up with interesting narratives but allowing a discussion beforehand means a much lower risk of hurt feelings and campaign implosions.</p>\n<h3>Rating and things that are off limits</h3>\n<p>Since the party is composed of adults, we decided R was acceptable rating. Knowing this, things can still be off limits!</p>\n<h4>No excessive body horror/graphic torture</h4>\n<p>We decided not to exclude this topics completely, but having vivid descriptions is not always necessary.</p>\n<h4>No bury alive</h4>\n<p>Sometimes triggers are just triggers, so this is completely off limits.</p>\n<h2>Campaign framework</h2>\n<p>The world for this campaign is a homebrew world of my own creation. You can find out more about it by exploring this site, as I will be adding to it as often as I can!</p>\n<p>However, I want to make something clear. I love Dungeons and Dragons, but I also like doing other things with my life at the same time! So as a way to prepare faster for sessions, I will never be afraid to take creative license of (<em>\"steal\"</em>) content from others for my campaign. I will try and give credit where I can, but sometimes it won't even be intentional. Eberron, is going to be an obvious source of information for the setting, but I will not hesitate to take bits and pieces from other settings such as Candlekeep or Van Richtens. Sorry!</p>\n<h2>House rules</h2>\n<p>Our group decided to do a few house rules for this campaign, some of which may be removed if we decide as a group we aren't a fan.</p>\n<h3>No Normal Inspiration</h3>\n<p>Firstly, inspiration just being advantage is boring... so we are trialing using what I know as the <em>\"card method\"</em>. When receiving inspiration for whatever, a player will get to draw from a deck of cards. They can keep this card for as long as they want, and then use it to add the value to any role! They can also have up to 3 cards at a time, encouraging role play and interesting ideas even if they already had one in the past. The cards can also come useful in clutch moments, where the player can use them all at once if they deem fit.</p>\n<p>We also wanted to make combat a bit more flavorful. To achieve this, we added 2 new rules into the mix.</p>\n<h3>Lingering Injuries</h3>\n<p>This optional rule is described in the Dungeon Masters Guide (DMG).</p>\n<blockquote>\n<p>Damage normally leaves no lingering effects. This option introduces the potential for long-term injuries.</p>\n</blockquote>\n<p>We added this to add flavour to combat, and have the possibility to create unique stories and memories. It also adds an extra layer of fear to combat, as going down can now have quite devastating consequences even if you survive. More strategy and communication is now required in combat, and having rules against metagaming means more in character screams for help!</p>\n<h3>Massive Damage</h3>\n<p>This rule is also described in the DMG, and can cause combat to quickly change without warning. Just some more flavour to the mix, but we are a bit more hesitant about this one. Death spirals are not fun.</p>\n<h3>Resurrection</h3>\n<p>This rule probably won't come up for a while, but we made it so resurrection adds 2 points of exhaustion. Dying fully needs to have some consequences!</p>\n<hr>\n<p>That's it! A long post for session 0 and I didn't even cover everything. If you have any questions, please post them in the <a href=\"https://github.com/fezproof/dnd/discussions\">discussions for this site</a>, plus any recommendations or ideas that you have :)</p>\n<p><em><strong>- DM</strong></em></p>"},"campaign":{"id":"eos-rising","name":"Eos Rising","link":"/dnd/campaigns/eos-rising","font":"font-eos"}}}}