{"props":{"player":{"id":"players/grub","name":"Grub","image":"/dnd/image/undefined-undefined/players/grub.jpg","content":{"prose":"<h2>Excerpt</h2>\n<p>A shapeless shadow danced across the flagstones in Shira square, the only noise heard is the pitter patter of four tiny paws clambering over the damp cobblestones. The sound of rain on tiled roofs drowning out the only telltale sign of his presence. His bushy tail crests the roof of the most prominent building in the village, giving him a chance to pause and check his surroundings for unaccounted variables. A habit that’s hard to break, as he knows he is unlikely to have missed anything. His pupils dilate to the size of marbles as he struggles to see in the low light of dusk. A myriad of villagers seeking refuge from the rain and one or two priests going about their business. Nothing of concern.</p>\n<p>Chewing for a few more seconds, he spits out a bamboo stalk, tossing it into the shrubbery as scurries across the rooftops. It always helped to calm his nerves when he could keep his mouth occupied.</p>\n<p>A large gong chimes from somewhere below him telling the village that the evening meal is being served for the impoverished. A tradition that has long been held by the faithful. The gong, however, means something else entirely for him. It means the plan is on schedule.</p>\n<hr>\n<p>Mechanisms click and turn as nimble paws manipulate the pins. With a sudden jerk, the lock is disengaged and the door swings open. Inside the priest's chambers his eyes are met with an enormous wealth of treasures and earthly possessions that would make any master thief quiver with excitement. But his beady eyes were drawn to a large painting hanging on the wall above an array of bejeweled candelabras laid out in the traditional fashion.</p>\n<p>“For a religion that worships spirits and what lies beyond, they sure are attached to what lies here” he thought with disdain.</p>\n<p>He approached the painting with trepidation, the murky red fur on the back of his neck rising with the tension that he always feels when at the climax of a job. The painting was a depiction of the forest spirit Yomu, a great panda surrounded by a sea of bamboo stalks. An almost too fitting depiction of the patron of plenty in a place that has too much. If his source had been correct, the painting was the key to what he was after. And considering the way the painting sat at an angle, with telltale signs of displacement, his suspicions proved true.</p>\n<hr>\n<p>The hidden safe provided as much resistance as the door to the chamber, that being little to none, and it had regurgitated its contents within minutes. An array of jewels the size of Lychee lay before him on pillows of silk and goose feathers. Each one boasted an attention to detail that demanded your gaze be undivided in appreciation.</p>\n<p>Snapping himself out of the trance, he moved with renewed determination, he was on a timer, and seconds mattered if he were to escape undetected. He reached into the safe and tucked under the pillows he retrieved a sealed envelope stamped with the priest’s insignia. A stylized dragon circling the sun. Deftly he removed his dagger and broke the seal with one quick motion, spilling the contents onto the large ornate desk in the center of the room. Holding one of the candles up to the letter he studied the text intently, his eyes narrowing on key pen strokes that would help identify the owner of said pen. Shapes and patterns, indiscernible to a commoner, but would be required for what he had planned. This had to look real.</p>\n<hr>\n<p>Wax dripped and fell on to the envelope, leaving a small pool where once was the priest's seal. Carefully, he unlatched a small jewelry box on the desk in front of him and removed the dragon seal from within. Taking care not to smudge the wax, he planted the seal firmly on to the envelope, leaving the letter appear free of tampering.</p>\n<p>Commotion. Pointed ears swiveled as the hallway echoed with the laughter of one of the house patrons, and he knew he had mere seconds remaining. Dashing to the safe he replaced the envelope and carefully removed a large green emerald from the display. He would not normally be interested in a mundane target such as a simple gemstone, however his sources were not free, and bargains must be struck. He hastily placed the gem in his pouch, while simultaneously removing a near identical replica. The blemishes on the roughly cut glass would eventually give him away, however by then it would be too late, the letter need only reach its destination.</p>\n<hr>\n<p>Turning to leave, with the painting firmly secured to the wall again, something felt wrong. Like an itch you can't scratch, like something was overlooked in his flawless plan and he can’t account for it. Panic ensues as he scans the room for what might be out of place, his eyes darting frantically in sporadic movements until they land on the reason for unease. A single red hair lay on the priest’s desk, tauntingly. A single red hair, that would have been his undoing. He cursed under his breath at his carelessness and quickly removed the evidence before departing.</p>\n<hr>\n<p>His pace quickened as he departed the shrine's mess hall.</p>\n<p>“No one even wants to look a beggar in the eye,” he thought smugly. Still riding the high of his success so far, he discarded his disguise which had now run its course. As soon as he broke the eyeline with the shrine he dashed into the cover of the trees, running as fast as he could into the bamboo forest. His mission had been a success, but it was far from over. Time would only tell if the letter would be effective.</p>\n<p>“But for now, I have a debt to pay”, he muttered to himself, his fingers subconsciously caressing the green gemstone in his pouch before retrieving another bamboo shoot to occupy his mouth.</p>\n<p>“And it won’t do to keep the <a class=\"   \" href=\"/dnd/campaigns/eos-rising/organisations/bridger-gang\">Bridgers</a> waiting.”</p>"}}}}